#### 1. Import pandas library

In [1]:
import numpy as np
import pandas as pd

#### 2. Import BigQuery library

In [2]:
import os
os.environ["GOOGLE_APPLICATION_CREDENTIALS"]="/home/eiroamd/Documents/IH/Ironhack Data Analytics.json"
from google.cloud import bigquery

#### 3. Create a connection to BigQuery

In [3]:
client = bigquery.Client()

#### 4. Import data from the users table from the stackoverflow public database for United Kingdom only

In [4]:
query1 = """
SELECT
    *
FROM
    `bigquery-public-data.stackoverflow.users`
WHERE
    location = 'United Kingdom'
"""

In [5]:
query_job = client.query(query=query1)
df1 = query_job.to_dataframe()
df1.head()

,id,display_name,about_me,age,creation_date,last_access_date,location,reputation,up_votes,down_votes,views,profile_image_url,website_url
0,1392312,Rossiar,,,2012-05-13 15:20:17.013000+00:00,2019-05-30 09:04:06.597000+00:00,United Kingdom,1254,966,9,116,https://i.stack.imgur.com/WTTkb.png,
1,2765940,Infamouslyuseless,"<p>i'm a 14 year old who enjoys programming, i...",,2013-09-10 17:06:09.177000+00:00,2013-12-22 22:17:26.917000+00:00,United Kingdom,382,18,0,71,https://www.gravatar.com/avatar/?s=128&d=ident...,http://infamouslyuseless.wix.com/infamouslyuse...
2,398513,philw,,,2010-07-21 21:47:34.340000+00:00,2019-05-31 08:48:11.310000+00:00,United Kingdom,456,301,7,123,https://i.stack.imgur.com/Bb529.jpg,
3,2964597,Andy Nugent,<p>Graduated from the University of Manchester...,,2013-11-07 11:36:44.400000+00:00,2019-05-31 16:36:36.793000+00:00,United Kingdom,656,85,14,94,,http://www.abovemobile.co.uk/
4,459359,acSlater,,,2010-09-27 10:13:39.647000+00:00,2019-05-30 14:47:39.877000+00:00,United Kingdom,598,149,2,144,,http://www.weareelevate.com

#### 5. Rename id column to user_id

In [6]:
df1 = df1.rename(columns={'id': 'user_id'})
df1.head()

,user_id,display_name,about_me,age,creation_date,last_access_date,location,reputation,up_votes,down_votes,views,profile_image_url,website_url
0,1392312,Rossiar,,,2012-05-13 15:20:17.013000+00:00,2019-05-30 09:04:06.597000+00:00,United Kingdom,1254,966,9,116,https://i.stack.imgur.com/WTTkb.png,
1,2765940,Infamouslyuseless,"<p>i'm a 14 year old who enjoys programming, i...",,2013-09-10 17:06:09.177000+00:00,2013-12-22 22:17:26.917000+00:00,United Kingdom,382,18,0,71,https://www.gravatar.com/avatar/?s=128&d=ident...,http://infamouslyuseless.wix.com/infamouslyuse...
2,398513,philw,,,2010-07-21 21:47:34.340000+00:00,2019-05-31 08:48:11.310000+00:00,United Kingdom,456,301,7,123,https://i.stack.imgur.com/Bb529.jpg,
3,2964597,Andy Nugent,<p>Graduated from the University of Manchester...,,2013-11-07 11:36:44.400000+00:00,2019-05-31 16:36:36.793000+00:00,United Kingdom,656,85,14,94,,http://www.abovemobile.co.uk/
4,459359,acSlater,,,2010-09-27 10:13:39.647000+00:00,2019-05-30 14:47:39.877000+00:00,United Kingdom,598,149,2,144,,http://www.weareelevate.com

#### 6. Import from the stackoverflow_posts table all items which have up to 20 view counts and only select 'id', 'owner_user_id', 'score', 'view_count', 'comment_count', 'favorite_count'

In [7]:
query2 = """
SELECT
    id,
    owner_user_id,
    score,
    view_count,
    comment_count,
    favorite_count
FROM
    `bigquery-public-data.stackoverflow.stackoverflow_posts`
WHERE
    view_count <= 20
"""

In [8]:
query_job = client.query(query=query2)
df2 = query_job.to_dataframe()
df2.head()

         id  owner_user_id  score  view_count  comment_count  favorite_count
0  24292513            NaN      0          19              7             NaN
1  35155703            NaN      0          16              0             NaN
2  35029414      3479566.0      0          16              1             NaN
3  33501255            NaN      1          14              0             NaN
4  31512834            NaN      0          12              2             NaN

#### 7. Rename id column to post_id and owner_user_id to user_id

In [9]:
df2 = df2.rename(columns={'id': 'post_id', 'owner_user_id': 'user_id'})
df2.head()

    post_id    user_id  score  view_count  comment_count  favorite_count
0  24292513        NaN      0          19              7             NaN
1  35155703        NaN      0          16              0             NaN
2  35029414  3479566.0      0          16              1             NaN
3  33501255        NaN      1          14              0             NaN
4  31512834        NaN      0          12              2             NaN

#### 8. Define new dataframes for users and posts with the following selected columns:
    **users columns**: user_id, reputation,views,up_votes,down_votes
    **posts columns**: post_id, score,user_id,view_count,comment_count

In [10]:
drop_cols_1 = ['display_name', 'about_me', 'age', 'creation_date',
       'last_access_date', 'location','profile_image_url','website_url']
df3 = df1.drop(drop_cols_1, axis=1)
col_order_1 = ['user_id','reputation', 'views', 'up_votes', 'down_votes']
df3 = df3[col_order_1]

In [11]:
df3 = df3.rename(columns={'id': 'user_id'})
df3.head()

   user_id  reputation  views  up_votes  down_votes
0  1392312        1254    116       966           9
1  2765940         382     71        18           0
2   398513         456    123       301           7
3  2964597         656     94        85          14
4   459359         598    144       149           2

In [12]:
drop_cols_2 = ['favorite_count']
df4 = df2.drop(drop_cols_2, axis=1)
df4.head()

    post_id    user_id  score  view_count  comment_count
0  24292513        NaN      0          19              7
1  35155703        NaN      0          16              0
2  35029414  3479566.0      0          16              1
3  33501255        NaN      1          14              0
4  31512834        NaN      0          12              2

In [13]:
col_order_2 = ['post_id', 'score', 'user_id', 'view_count', 'comment_count']
df4 = df4[col_order_2]
df4.head()

    post_id  score    user_id  view_count  comment_count
0  24292513      0        NaN          19              7
1  35155703      0        NaN          16              0
2  35029414      0  3479566.0          16              1
3  33501255      1        NaN          14              0
4  31512834      0        NaN          12              2

#### 8. Merge both dataframes, users and posts. 
You will need to make a [merge](https://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.merge.html) of posts and users dataframes.

In [14]:
df5 = pd.merge(df3,df4, on='user_id')
df5.head()

,user_id,reputation,views,up_votes,down_votes,post_id,score,view_count,comment_count
0,398513,456,123,301,7,32313772,0,12,1
1,3310334,4754,1256,739,107,36970705,-1,17,0
2,2126810,171,112,28,0,26663431,-1,16,4
3,1596371,7164,335,431,19,34472733,1,19,0
4,1596371,7164,335,431,19,36988426,1,17,0

#### 9. How many missing values do you have in your merged dataframe?

In [15]:
df5.isnull().sum()

user_id          0
reputation       0
views            0
up_votes         0
down_votes       0
post_id          0
score            0
view_count       0
comment_count    0
dtype: int64

#### Bonus: Identify extreme values in your merged dataframe, create a dataframe called outliers with the same columns as our data set and calculate the bounds. The values of the outliers dataframe will be the values of the merged_df that fall outside that bounds. You will need to save your outliers dataframe to a csv file on your-code folder. Hint: post_id cannot have outliers!

In [21]:
stats = df5.describe()
stats

,user_id,reputation,views,up_votes,down_votes,post_id,score,view_count,comment_count
count,1.088000e+03,1088.000000,1088.000000,1088.000000,1088.000000,1.088000e+03,1088.000000,1088.000000,1088.000000
mean,2.241463e+06,4815.090074,594.238051,384.477941,47.390625,3.400591e+07,0.125000,15.566176,0.927390
std,1.813582e+06,15438.390331,1568.560266,730.548850,167.131398,4.448060e+06,0.588919,3.699031,1.641589
min,2.740000e+02,1.000000,0.000000,0.000000,0.000000,4.142174e+06,-7.000000,3.000000,0.000000
25%,6.511890e+05,139.000000,37.000000,16.000000,0.000000,3.283790e+07,0.000000,13.000000,0.000000
50%,1.903218e+06,774.000000,135.000000,89.000000,3.000000,3.552170e+07,0.000000,16.000000,0.000000
75%,3.511274e+06,3128.250000,462.250000,388.250000,20.000000,3.701194e+07,0.000000,19.000000,1.000000
max,6.449207e+06,263224.000000,26310.000000,7664.000000,2440.000000,3.776986e+07,4.000000,20.000000,11.000000

In [22]:
drop_cols_stats = ['post_id']
stats = stats.drop(drop_cols_stats, axis=1)

In [23]:
stats = stats.T
stats

,count,mean,std,min,25%,50%,75%,max
user_id,1088.0,2.241463e+06,1.813582e+06,274.0,651189.0,1903218.0,3511273.75,6449207.0
reputation,1088.0,4.815090e+03,1.543839e+04,1.0,139.0,774.0,3128.25,263224.0
views,1088.0,5.942381e+02,1.568560e+03,0.0,37.0,135.0,462.25,26310.0
up_votes,1088.0,3.844779e+02,7.305489e+02,0.0,16.0,89.0,388.25,7664.0
down_votes,1088.0,4.739062e+01,1.671314e+02,0.0,0.0,3.0,20.00,2440.0
score,1088.0,1.250000e-01,5.889195e-01,-7.0,0.0,0.0,0.00,4.0
view_count,1088.0,1.556618e+01,3.699031e+00,3.0,13.0,16.0,19.00,20.0
comment_count,1088.0,9.273897e-01,1.641589e+00,0.0,0.0,0.0,1.00,11.0

In [24]:
stats['IQR'] = stats['75%'] - stats['25%']
stats.head()

,count,mean,std,min,25%,50%,75%,max,IQR
user_id,1088.0,2.241463e+06,1.813582e+06,274.0,651189.0,1903218.0,3511273.75,6449207.0,2860084.75
reputation,1088.0,4.815090e+03,1.543839e+04,1.0,139.0,774.0,3128.25,263224.0,2989.25
views,1088.0,5.942381e+02,1.568560e+03,0.0,37.0,135.0,462.25,26310.0,425.25
up_votes,1088.0,3.844779e+02,7.305489e+02,0.0,16.0,89.0,388.25,7664.0,372.25
down_votes,1088.0,4.739062e+01,1.671314e+02,0.0,0.0,3.0,20.00,2440.0,20.00

In [25]:
stats['low'] = stats['25%'] - 1.5*stats['IQR']
stats['high'] = stats['75%'] + 1.5*stats['IQR']

In [26]:
outliers = pd.DataFrame(columns=df5.columns)

for col in stats.index:
    iqr = stats.at[col,'IQR']
    cutoff = iqr * 1.5
    lower = stats.at[col,'25%'] - cutoff
    upper = stats.at[col,'75%'] + cutoff
    results = df5[(df5[col] < lower) |
                  (df5[col] > upper)].copy()
    results['Outlier'] = col
    outliers = outliers.append(results)

/home/eiroamd/.local/lib/python3.6/site-packages/pandas/core/frame.py:6692: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=False'.

To retain the current behavior and silence the warning, pass 'sort=True'.

  sort=sort)

In [27]:
outliers.head()

,Outlier,comment_count,down_votes,post_id,reputation,score,up_votes,user_id,view_count,views
7,reputation,0,571,37466249,41898,0,2195,37947,19,3435
8,reputation,2,758,25726485,21370,0,829,978756,18,3847
13,reputation,0,1440,13199838,88724,0,2323,14357,20,8090
14,reputation,1,1440,33375247,88724,0,2323,14357,12,8090
15,reputation,0,20,23653190,17320,1,3275,2120261,20,816

In [28]:
outliers_export = outliers.to_csv('outliers_dani.csv',sep=',', index=False)